app/controllers/tables_controller.rb

SELECT `tables`.* FROM `tables`
---
  def index
    @tables = Table.all

INSERT INTO `tables` (`name`, `description`, `created_at`, `updated_at`) VALUES ('Arquitectura', 'Edificios', '2015-06-06 01:42:13', '2015-06-06 01:42:13')
---
  def create
    @table = Table.new(table_params)

    respond_to do |format|
      if @table.save

DELETE FROM `tables` WHERE `tables`.`id` = 4
---
  def destroy
    @table.destroy

SELECT  `tables`.* FROM `tables` WHERE `tables`.`id` = 4 LIMIT 1
---
    def set_table
      @table = Table.find(params[:id])